# Control Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
TabbedDialogExtension..::..Control Property
TabbedDialogExtension Class See Also
---
The control.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public UserControl Control { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Control As UserControl
	Get
```

Visual C++
---
```text
public:
property UserControl^ Control {
	UserControl^ get ();
}
```

# See Also
TabbedDialogExtension Class
Autodesk.Revit.UI Namespace